Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Checking for Updates
zh_cn: 检查更新

source: Checking for platform updates
zh_cn: 检查平台更新

source: Checking for plugin updates
zh_cn: 检查插件更新

source: Checking red files
zh_cn: 检查红色文件

source: Checking tail call usages
zh_cn: 检查尾调用用法

source: Checkout
zh_cn: 检出

source: Checkout From Version Control
zh_cn: 从版本控制中检出

source: Checkout from
zh_cn: 从...检出

source: Checks for available IDE and plugin updates
zh_cn: 检查可用的 IDE 和插件更新

source: Checks for available plugin updates
zh_cn: 检查可用的插件更新

source: Checks object type with instanceof and down-casts it
zh_cn: 使用 instanceof 检查对象类型并将其降级

source: Children contain errors
zh_cn: 子类有错误

source: Choose &Sources...
zh_cn: 选择源...(&S)

source: Choose &fields to be included in equals()
zh_cn: 选择要包含在 equals() 中的字段(&F)

source: Choose &fields to be included in hashCode()
zh_cn: 选择要包含在 hashCode() 中的字段(&F)

source: Choose File | Settings (Windows or *nix) or PhpStorm | Preferences (MacOS) on the main menu, and then open the page Terminal.
zh_cn: 在主菜单选择 File | Settings (Windows 或 *nix) 或 PhpStorm | Preferences (MacOS) ，然后打开 Terminal 页。

source: Choose File | Settings (Windows/*nix) or PyCharm | Preferences (Mac) on the main menu, and then open the page Terminal.
zh_cn: 在主菜单选择 File | Settings (Windows/*nix) 或 PyCharm | Preferences (Mac) ，然后打开 Terminal 页。

source: Choose File | Settings (on Windows/*nix) or Preferences (on MacOS), and then open the page Terminal.
zh_cn: 选择 File | Settings (Windows 或 *nix) 或 Preferences (MacOS) ，然后打开 Terminal 页。

source: Choose File | Settings on the main menu, and then open the page Terminal.
zh_cn: 在主菜单选择 File | Settings ，然后打开 Terminal 页。

source: Choose VCS | VCS Operations Popup on the main menu, and get a popup with the VCS commands that are relevant to the current context:
zh_cn: 在主菜单选择 VCS | VCS Operations Popup ，然后获得一个与当前上下文关联的 VCS 命令弹窗。

source: Choose Action Icon
zh_cn: 选择操作图标

source: Choose Actions To Add
zh_cn: 选择要添加的操作

source: Choose Ant Target to Execute
zh_cn: 选择 Ant 目标来执行

source: Choose Applet Class
zh_cn: 选择 Applet 类

source: Choose Artifacts
zh_cn: 选择构件

source: Choose Base Class of the Hierarchy to Search In
zh_cn: 选择层次结构的基类进行搜索

source: Choose Changelist
zh_cn: 选择更改列表

source: Choose Class
zh_cn: 选择类

source: Choose Classes to Highlight Overridden Methods from
zh_cn: 选择要突出显示覆盖方法的类

source: Choose Code Style Scheme
zh_cn: 选择代码样式方案

source: Choose Color
zh_cn: 选择颜色

source: Choose Configuration to Execute
zh_cn: 选择要执行的配置

source: Choose Content to Paste
zh_cn: 选择内容粘贴

source: Choose Custom Template
zh_cn: 选择自定义模板

source: Choose Date
zh_cn: 选择日期

source: Choose Declaration
zh_cn: 选择声明

source: Choose Destination Class
zh_cn: 选择目标类

source: Choose Destination Directory
zh_cn: 选择目标目录

source: Choose Destination Package
zh_cn: 选择目标包

source: Choose Directory
zh_cn: 选择目录

source: Choose Error Level
zh_cn: 选择错误级别

source: Choose Exception Classes to Highlight
zh_cn: 选择异常类以高亮显示

source: Choose Field's class
zh_cn: 选择字段的类

source: Choose Fields to Initialize by Constructor
zh_cn: 选择由构造方法初始化的字段

source: Choose File To Compare
zh_cn: 选择文件来比较

source: Choose HTML File
zh_cn: 选择 HTML 文件

source: Choose Implementing Class
zh_cn: 选择实现类

source: Choose Imported Classes to Highlight
zh_cn: 选择 Imported 类高亮显示

source: Choose Imported Members to Highlight
zh_cn: 选择 Imported 成员高亮显示

source: Choose Library
zh_cn: 选择库

source: Choose Lookup Item
zh_cn: 选择查询项

source: Choose Lookup Item Replace
zh_cn: 选择查询项替换

source: Choose Lookup Item and Insert Dot
zh_cn: 选择查询项并插入点

source: Choose Lookup Item and Invoke Complete Statement
zh_cn: 选择查询项并将语句补充完整

source: Choose Main Class
zh_cn: 选择主类

source: Choose Method to Import
zh_cn: 选择导入方法

source: Choose Module
zh_cn: 选择模块

source: Choose Module to Add Dependency on
zh_cn: 选择模块添加依赖关系

source: Choose Modules
zh_cn: 选择模块

source: Choose Modules to JAR
zh_cn: 选择模块到 JAR

source: Choose Output Folder
zh_cn: 选择输出文件夹

source: Choose Package
zh_cn: 选择包

source: Choose Project, Sourcepath or Classpath tree in the Project View window
zh_cn: 在项目视图窗口中选择项目，源路径或类路径树

source: Choose Properties File
zh_cn: 选择属性文件

source: Choose Schemes
zh_cn: 选择方案

source: Choose Super Class Constructor
zh_cn: 选择超类构造函数

source: Choose Super Class Constructors
zh_cn: 选择超类构造函数

source: Choose Super Method of {0}
zh_cn: 选择 {0} 的超类方法

source: Choose Superclass
zh_cn: 选择超类

source: Choose Target Class
zh_cn: 选择目标类

source: Choose Test Class
zh_cn: 选择测试类

source: Choose Test Method
zh_cn: 选择测试方法

source: Choose Type
zh_cn: 选择类型

source: Choose and re-run recent find usages
zh_cn: 选择和重新运行最近的查找使用

source: Choose annotation to add
zh_cn: 选择要添加的注解

source: Choose annotation to delete
zh_cn: 选择要删除的注解

source: Choose class
zh_cn: 选择类

source: Choose configuration to run
zh_cn: 选择要运行的配置

source: Choose constructors to add initialization to
zh_cn: 选择构造函数来添加初始化

source: Choose directory where the library will be copied
zh_cn: 选择要复制库的目录

source: Choose export file path or directory where to create new file
zh_cn: 选择导出文件路径或创建新文件的目录

source: Choose file
zh_cn: 选择文件

source: Choose file where current module renaming scheme will be stored.
zh_cn: 选择当前模块重命名方案将被存储的文件。

source: Choose implementation to copy
zh_cn: 选择要复制的实现

source: Choose scope and edit options for the Find Usages action
zh_cn: 为查找使用操作选择范围和编辑选项

source: Choose super class or interface
zh_cn: 选择超类或接口

source: Choose super method
zh_cn: 选择超类方法

source: Choose super property
zh_cn: 选择超类属性

source: Choose symbol from the drop-down list that appears.
zh_cn: 从出现的下拉列表中选择符号。

source: Choose the class from a drop-down list that appears.
zh_cn: 从出现的下拉列表中选择类。

source: Choose the desired action from the suggestion list.
zh_cn: 从建议列表中选择所需的操作。

source: Choose the desired file and press Enter to open it.
zh_cn: 选择所需的文件，然后按 Enter 将其打开。

source: Choose the desired inspection from the suggestion list and then specify the desired scope.
zh_cn: 从建议列表中选择所需的检查，然后指定所需的范围。

source: Choose the ones you want to be deleted
zh_cn: 选择您要删除的那些

source: Choose the statement to unwrap/remove
zh_cn: 选择语句解除包围/删除

source: Choose the symbol from a drop-down list that appears.
zh_cn: 从出现的下拉列表中选择符号。

source: Chop down if long
zh_cn: 截断如果过长

source: Chop down if long.
zh_cn: 截断如果过长。

source: Circular Dependency Warning
zh_cn: 循环依赖警告

source: Circular Layout
zh_cn: 环形布局

source: Cl_ose Active Tab
zh_cn: 关闭活动选项卡(_O)

source: Class
zh_cn: 类

source: Class &Path:
zh_cn: 类路径:(&P)

source: Class &constructor(s)
zh_cn: 类构造函数(&C)

source: Class &name:
zh_cn: 类名:(&N)

source: Class ''{0}'' clashes with package of same name
zh_cn: 类 ''{0}'' 与同名包冲突

source: Class ''{0}'' could be implicitly subclassed and must not be final
zh_cn: 类 ''{0}'' 可以隐式的子类化且不能为 final

source: Class ''{0}'' is already defined in a single static import
zh_cn: 类 ''{0}'' 已经在单个静态导入中定义

source: Class ''{0}'' is ambiguous in a single static import
zh_cn: 类 ''{0}'' 在单个静态导入中是不明确的

source: Class ''{0}'' is in the default package
zh_cn: 类 ''{0}'' 在默认包中

source: Class ''{0}'' is never used
zh_cn: 类 ''{0}'' 从未使用

source: Class ''{0}'' is not loaded
zh_cn: 类 ''{0}'' 没有加载

source: Class ''{0}'' is public, should be declared in a file named ''{0}.java''
zh_cn: 类 ''{0}'' 是 public 的，应该在名为 ''{0}.java'' 的文件中声明

source: Class ''{0}'' must either be declared abstract or implement abstract method ''{1}'' in ''{2}''
zh_cn: 类 ''{0}'' 必须被声明为 abstract 或者实现 ''{2}'' 中的抽象方法 ''{1}''

source: Class ''{0}'' must implement abstract method ''{1}'' in ''{2}''
zh_cn: 类 ''{0}'' 必须实现 ''{2}'' 中的抽象方法 ''{1}''

source: Class ''{0}'' not found in module ''{1}''
zh_cn: 类 ''{0}'' 没有在模块 ''{1}'' 中找到

source: Class 'java.util.ResourceBundle' cannot be found.
zh_cn: 找不到类 'java.util.ResourceBundle' 。

source: Class Exclusion Filters
zh_cn: 类排除过滤器

source: Class Fields//Constant (static final field)
zh_cn: 类字段//常量 (static final 字段)

source: Class Fields//Instance field
zh_cn: 类字段//实例字段

source: Class Fields//Instance final field
zh_cn: 类字段//实例 final 字段

source: Class Fields//Static field
zh_cn: 类字段//静态字段

source: Class Filters
zh_cn: 类过滤器

source: Class Hierarchy
zh_cn: 类层次结构

source: Class Not Found
zh_cn: 类未找到

source: Class _Name Completion
zh_cn: 类名补全(_N)

source: Class annotations
zh_cn: 类注释

source: Class at {0}:{1}
zh_cn: 类在 {0}:{1}

source: Class cannot extend multiple classes
zh_cn: 类不能继承多个类

source: Class cannot have type parameters
zh_cn: 该类不能有类型参数

source: Class cannot inherit from its type parameter
zh_cn: 类不能从其类型参数继承

source: Class circularity error : {0}
zh_cn: 类循环错误: {0}

source: Class count to use import with '*':
zh_cn: 使用 '*' 导入的类数：

source: Class definition not found : {0}
zh_cn: 找不到类定义：{0}

source: Class does not exist in project.
zh_cn: 类在项目中不存在。

source: Class filters
zh_cn: 类过滤器:

source: Class format error : {0}
zh_cn: 类格式错误: {0}

source: Class has no fields
zh_cn: 类没有字段

source: Class has one instantiation but it is not reachable from entry points.
zh_cn: 类有一个实例化，但从入口点无法访问。

source: Class has {0, choice, 1#instantiation|2#{0,number} instantiations} but they are not reachable from entry points.
zh_cn: 类有实现，但他们从入口点是不可达的。

source: Class has {0} defined but does not define {1}
zh_cn: 类定义了 {0} ，但没有定义 {1}

source: Class initializer is too complex to analyze by data flow algorithm
zh_cn: 类初始化器过于复杂，无法通过数据流算法进行分析

source: Class is never instantiated.
zh_cn: 类从未实例化。

source: Class is never used
zh_cn: 类从未使用

source: Class is not instantiated.
zh_cn: 类没有实例化。

source: Class is not public
zh_cn: 类不是公共的

source: Class is not valid
zh_cn: 类无效

source: Class left brace
zh_cn: 类的左大括号

source: Class literal type may not be annotated
zh_cn: 类文字类型不应被注释

source: Class metrics
zh_cn: 类指标

source: Class name
zh_cn: 类名称

source: Class name expected
zh_cn: 期望类名

source: Class name expected here
zh_cn: 这里期望类名

source: Class name should be specified
zh_cn: 需指定类名

source: Class name's element separator:
zh_cn: 类名元素分隔符：

source: Class name's modifier separator:
zh_cn: 类名的修饰符分隔符:

source: Class name:
zh_cn: 类名:

source: Class not loaded : {0}
zh_cn: 类未加载：{0}

source: Class not specified.
zh_cn: 类未指定。

source: Class or array expected
zh_cn: 期望类或数组

source: Class or array type expected while evaluating field ''{0}''
zh_cn: 解析字段 ''{0}'' 时预期类或数组类型

source: Class reference expected
zh_cn: 预期类引用

source: Class static initializer is not reachable.
zh_cn: 类静态初始化程序无法访问。

source: Class static member access
zh_cn: 类静态成员访问

source: Class structure
zh_cn: 类结构

source: Class to Import
zh_cn: 要导入的类

source: Class to be moved
zh_cn: 要移动的类

source: Class to exclude
zh_cn: 要排除的类

source: Class to inline
zh_cn: 要内联的类

source: Class {0}
zh_cn: 类 {0}

source: Class {0} already contains an inner class named {1}
zh_cn: 类 {0} 已包含一个名为 {1} 的内部类

source: Class {0} already exists
zh_cn: 类 {0} 已存在

source: Class {0} does not exist
zh_cn: 类 {0} 不存在

source: Class {0} does not exist.
zh_cn: 类 {0} 不存在。

source: Class {0} does not have base classes or interfaces
zh_cn: 类 {0} 没有基类或基本接口

source: Class {0} does not have implicit default constructor
zh_cn: 类 {0} 没有隐式的默认构造函数

source: Class {0} does not have inheritors
zh_cn: 类 {0} 没有继承者

source: Class {0} has been successfully created
zh_cn: 已成功创建类 {0}

source: Class {0} is not a descendant of Throwable
zh_cn: 类 {0} 不是 Throwable 的后代

source: Class {0} is not accessible from target {1}
zh_cn: 类 {0} 不可以从目标 {1} 访问

source: Class {0} not found.
zh_cn: 类 {0} 未找到。

source: Class&path:
zh_cn: 类路径:(&P)

source: Class/method reference, quoted text, or HTML link are expected after @see tag
zh_cn: 在@see 标签之后，预期类/方法引用，引用文本或 HTML 链接

source: Classes
zh_cn: 类

source: Classes and Interfaces//Abstract class
zh_cn: 类和接口//抽象类

source: Classes and Interfaces//Anonymous class
zh_cn: 类和接口//匿名类

source: Classes and Interfaces//Class
zh_cn: 类和接口//类

source: Classes and Interfaces//Enum
zh_cn: 类和接口//枚举

source: Classes and Interfaces//Interface
zh_cn: 类和接口//接口

source: Classes cannot directly extend 'java.lang.Enum'
zh_cn: 类不能直接扩展 'java.lang.Enum'

source: Classes matching pattern
zh_cn: 类匹配模式

source: Classes to be moved to {0}
zh_cn: 要移动至 {0} 的类

source: Classes to check
zh_cn: 要检查的类

source: Classes to push down members to {0}
zh_cn: 要下推成员到 {0} 的类

source: Classes which have a superclass and implement an interface cannot be inlined
zh_cn: 具有超类和实现接口的类不能内联

source: Classes which have subclasses cannot be inlined
zh_cn: 具有子类的类不能内联

source: Classes which implement multiple interfaces cannot be inlined
zh_cn: 实现多个接口的类不能内联

source: Classes with usages in non-Java files
zh_cn: 非 Java 文件中使用的类

source: Classes//Class name
zh_cn: 类//类名

source: Classes//Class reference
zh_cn: 类//类引用

source: Classes//Instance field
zh_cn: 类//实例字段

source: Classes//Instance method
zh_cn: 类//实例方法

source: Classes//Interface name
zh_cn: 类//接口名

source: Classes//Static field
zh_cn: 类//静态字段

source: Classes//Static method
zh_cn: 类//静态方法

source: Classes:
zh_cn: 类：

source: Classic &View
zh_cn: 经典视图(&V)

source: Classpath
zh_cn: 类路径

source: Clean Up...
zh_cn: 清理...

source: Clean up old output directories
zh_cn: 清理旧的输出目录

source: Cleaner captures object reference
zh_cn: Cleaner 捕获对象引用

source: Cleaning Patch Files
zh_cn: 清理补丁文件

source: Cleaning Quarantine Status
zh_cn: 清除隔离状态

source: Cleaning quarantined status for {0}
zh_cn: 清除 {0} 的隔离状态

source: Cleanup code
zh_cn: 清理代码

source: Cleanup code on...
zh_cn: 清除代码于...

source: Cleanup should be performed.
zh_cn: 应执行清理。

source: Clear All
zh_cn: 清除全部

source: Clear Filtering
zh_cn: 清除过滤

source: Clear Read-Only Status
zh_cn: 清除只读状态

source: Clear Recent Projects List
zh_cn: 清除最近的项目列表

source: Clear passwords
zh_cn: 清除密码

source: Clear text
zh_cn: 清除文本

source: Clear text in text components
zh_cn: 在文本组件中清除文本

source: Click
zh_cn: 点击

source: Click Count
zh_cn: 点击计数

source: Click Pad
zh_cn: 点击 Pad

source: Click arrow to show selected item as left/right diff version
zh_cn: 单击箭头将所选项目显示为左/右差异版本

source: Click color icons to choose the desired color from the color picker.
zh_cn: 单击颜色图标可以从颜色选择器中选择所需的颜色。

source: Click here to enter mouse shortcut
zh_cn: 点击这里输入鼠标快捷键

source: Click here to view object tree
zh_cn: 点击这里查看对象树

source: Click one of these buttons to append contents of the current pane of the Differences viewer to the other pane.
zh_cn: 单击其中一个按钮将差异查看器的当前窗格的内容附加到另一个窗格。

source: Click or press Alt-Enter
zh_cn: 单击或按 Alt + Enter

source: Click or press Shift+Enter
zh_cn: 点击或按 Shift+Enter

source: Click or press {0}
zh_cn: 点击或按 {0}

source: Click the color icon to choose the desired color from the color picker:
zh_cn: 点击颜色图标从颜色选择器中选择所需的颜色：

source: Click the icon or link to select your VCS.
zh_cn: 点击图标或链接,选择您的 VCS。

source: Click this button to revert changes.
zh_cn: 单击此按钮还原更改。

source: Click to change the language
zh_cn: 单击更改语言

source: Click to configure highlighting for this file
zh_cn: 单击配置此文件的高亮

source: Click to configure inspection profiles
zh_cn: 单击配置检查配置文件

source: Click to customize
zh_cn: 单击自定义

source: Click to go to line
zh_cn: 点击转到行

source: Click to navigate
zh_cn: 点击导航

source: Click to open tasks window
zh_cn: 单击打开任务窗口

source: Click to show/hide background tasks window
zh_cn: 单击以显示/隐藏后台任务窗口

source: Click to toggle the read-only attribute
zh_cn: 点击切换只读属性

source: Clicking a hyperlink brings you directly to an issue in your task tracker.
zh_cn: 单击超链接可以直接引导您到任务跟踪器中的问题。

source: Clip Area
zh_cn: 裁剪区域

source: Clipboard vs Editor
zh_cn: 剪贴板 vs 编辑器

source: Clipboard vs Selected Value
zh_cn: 剪贴板与选中的值

source: Clipboard vs {0}
zh_cn: 剪贴板 vs {0}

source: Clone
zh_cn: 克隆

source: Clone Caret Above
zh_cn: 在上方克隆插入符号

source: Clone Caret Below
zh_cn: 在下方克隆插入符号

source: Clone Class
zh_cn: 克隆类

source: Clone directory {0}
zh_cn: 克隆目录 {0}

source: Clone file {0}
zh_cn: 克隆文件 {0}

source: Clone files/directories
zh_cn: 克隆文件/目录

source: Clone the cursor strictly upwards or downwards.
zh_cn: 严格向上或向下地克隆光标。

source: Clone {0} {1}
zh_cn: 克隆 {0}{1}

source: Cloneable implementations
zh_cn: Cloneable 实现

source: Cloning issues
zh_cn: 克隆问题

source: Close
zh_cn: 关闭

source: Close Active Editor
zh_cn: 关闭活动编辑器

source: Close Active Window
zh_cn: 关闭活动窗口

source: Close All
zh_cn: 关闭所有

source: Close All But This
zh_cn: 关闭所有除了这个

source: Close All Editors
zh_cn: 关闭所有编辑器

source: Close All Unmodified Editors
zh_cn: 关闭所有未修改的编辑器

source: Close All but Pinned
zh_cn: 关闭所有未固定的

source: Close All but Pinned In Group
zh_cn: 关闭组内所有未固定标签页

source: Close Annotations
zh_cn: 关闭注释

source: Close Ant Build Messages
zh_cn: 关闭 Ant 构建消息

source: Close Dependency Viewer
zh_cn: 关闭依赖视图

source: Close First
zh_cn: 关闭第一个

source: Close Other Tabs
zh_cn: 关闭其他选项卡

source: Close Others
zh_cn: 关闭其他

source: Close Pro_ject
zh_cn: 关闭项目(_J)

source: Close Pro_jects in Current Window
zh_cn: 关闭当前窗口中的项目(_J)

source: Close Tab
zh_cn: 关闭选项卡

source: Close _All
zh_cn: 关闭所有(_A)

source: Close _All In Group
zh_cn: 关闭组内所有(_A)

source: Close _Others
zh_cn: 关闭其他(_O)

source: Close _Unmodified
zh_cn: 关闭未修改的(_U)

source: Close _Unmodified In Group
zh_cn: 关闭组内未修改(_U)

source: Close active editor
zh_cn: 关闭活动编辑器

source: Close active tool window tab
zh_cn: 关闭活动工具窗口选项卡

source: Close all editors in active tab group
zh_cn: 在活动选项卡组中关闭所有编辑窗口

source: Close all editors which are not pinned
zh_cn: 关闭所有未固定的编辑窗口

source: Close all non-modified editors
zh_cn: 关闭所有未修改的编辑窗口

source: Close all open editors except the active one
zh_cn: 除活动编辑窗口外关闭所有其他窗口

source: Close all tabs which are not pinned
zh_cn: 关闭所有未固定的视图

source: Close all views
zh_cn: 关闭所有视图

source: Close current project
zh_cn: 关闭当前项目

source: Close currently focused content
zh_cn: 关闭当前焦点的内容

source: Close less frequently used files
zh_cn: 关闭不常用的文件

source: Close non-modified files first
zh_cn: 先关闭未修改的文件

source: Close other views
zh_cn: 关闭其他视图

source: Close thumbnails
zh_cn: 关闭缩略图

source: Close thumbnails window
zh_cn: 关闭缩略图窗口

source: Close view
zh_cn: 关闭视图

source: Closing tag is not done
zh_cn: 关闭标签未完成

source: Closing tag is redundant
zh_cn: 关闭标签是多余的

source: Closing tag matches nothing
zh_cn: 关闭标签没有匹配

source: Closing tag name missing
zh_cn: 关闭标签名称丢失

source: Closure
zh_cn: 关闭

source: Co&ndition:
zh_cn: 条件:(&N)

source: Co&py existing template...
zh_cn: 复制现有模板...(&P)

source: Co_mpare File with Editor
zh_cn: 与编辑器中的文件比较(_M)

source: Code
zh_cn: 代码

source: Code Analysis
zh_cn: 代码分析

source: Code Assistants
zh_cn: 代码助手

source: Code Block
zh_cn: 代码块

source: Code Completion
zh_cn: 代码补全

source: Code Coverage
zh_cn: 代码覆盖率

source: Code Coverage Actions
zh_cn: 代码覆盖率的操作

source: Code Duplication Analysis
zh_cn: 代码重复分析

source: Code Duplication Analysis Settings
zh_cn: 代码重复分析设置

source: Code Editing
zh_cn: 代码编辑

source: Code Editor View Actions
zh_cn: 代码编辑器视图操作

source: Code Folding
zh_cn: 代码折叠

source: Code Folding Settings
zh_cn: 代码折叠设置

source: Code Formatting Actions
zh_cn: 代码格式化操作

source: Code Fragment &Mode
zh_cn: 代码片段模式(&M)

source: Code Fragment Evaluation
zh_cn: 代码片段计算

source: Code Generation
zh_cn: 代码生成

source: Code Inspection
zh_cn: 代码检查

source: Code Inspection results
zh_cn: 代码检查结果

source: Code Style
zh_cn: 代码样式

source: Code Style Scheme
zh_cn: 代码样式方案

source: Code View Actions
zh_cn: 代码视图操作

source: Code analysis can''t be performed while {0} updates the indices in background.
zh_cn: 当 {0} 更新后台的索引时，不能执行代码分析。

source: Code analysis is not possible right now
zh_cn: 现在不能进行代码分析

source: Code braces
zh_cn: 代码大括号

source: Code cache size of {0} MB is too low.
zh_cn: {0} MB 的代码缓存太小了。

source: Code contains syntax errors.
zh_cn: 代码包含语法错误。

source: Code coverage is supported for jre 5.0 or higher
zh_cn: jre 5.0或更高版本支持代码覆盖

source: Code duplicates ({0,choice, 0#No|1#1 fragment|2#{0,number} fragments}{1,choice, 0#|1# in 1 file|2# in {1,number} files})
zh_cn: 代码重复 ({0} 片断{1,choice, 0#|1#在 1 个文件中|2# 在 {1,number} 个文件中})

source: Code fragment expected
zh_cn: 期望代码片段

source: Code fragment:
zh_cn: 代码片段:

source: Code from {0}
zh_cn: 代码从 {0}

source: Code maturity
zh_cn: 代码成熟度

source: Code maturity issues
zh_cn: 代码成熟度问题

source: Code style issues
zh_cn: 代码样式问题

source: Code usages
zh_cn: 代码使用

source: Code//Identifier under caret
zh_cn: 代码//插入符下的标识符

source: Code//Identifier under caret (write)
zh_cn: 代码//插入符下的标识符(写)

source: Code//Injected language fragment
zh_cn: 代码//注入语言片段

source: Code//Line number
zh_cn: 代码//行号

source: Code//Matched brace
zh_cn: 代码//匹配的括号

source: Code//Method separator color
zh_cn: 代码//方法分隔符颜色

source: Code//Selected vertical indent guide
zh_cn: 代码//选中项垂直缩进指南

source: Code//TODO defaults
zh_cn: 代码//TODO 默认

source: Code//Unmatched brace
zh_cn: 代码//不匹配的括号

source: Code//Vertical indent guide
zh_cn: 代码//垂直缩进指南

source: Coll_apse Recursively
zh_cn: 递归折叠(_A)

source: Collapse 'if' statement and extract side effect
zh_cn: 折叠 'if' 语句并提取 side effect

source: Collapse 'if' statement {0}
zh_cn: 折叠 'if' 语句 {0}

source: Collapse All
zh_cn: 全部折叠

source: Collapse Panel
zh_cn: 折叠面板

source: Collapse Tree Node
zh_cn: 折叠树节点

source: Collapse _All
zh_cn: 全部折叠(_A)

source: Collapse all build file nodes
zh_cn: 折叠所有构建文件节点

source: Collapse all documentation comments
zh_cn: 折叠所有的文档注释

source: Collapse all folding regions (in selection)
zh_cn: 全部折叠可折叠区域(选中部分)

source: Collapse all test suites
zh_cn: 折叠所有测试程序组

source: Collapse block at caret recursively
zh_cn: 在插入符号处递归折叠块

source: Collapse by default:
zh_cn: 默认折叠:

source: Collapse d_oc comments
zh_cn: 折叠 doc 注释(_O)

source: Collapse empty tag
zh_cn: 折叠空标签

source: Collapse folding region at caret
zh_cn: 在插入符号处折叠可折叠区

source: Collect and Show Logs in File Manager
zh_cn: 收集日志并在文件管理器中显示

source: Collect and Zip logs and settings into file
zh_cn: 收集并打包日志和设置到文件中

source: Collecting Dependencies
zh_cn: 收集依赖关系

source: Collecting Processes...
zh_cn: 收集进程...

source: Collecting data…
zh_cn: 收集数据…

source: Collection <code>#ref</code> is always empty
zh_cn: 集合 <code>#ref</code> 总是空

source: Collections.sort could be replaced with List.sort
zh_cn: Collections.sort 可以替换为 List.sort

source: Color
zh_cn: 颜色

source: Color #1
zh_cn: 颜色 #1

source: Color #2
zh_cn: 颜色 #2

source: Color #3
zh_cn: 颜色 #3

source: Color #4
zh_cn: 颜色 #4

source: Color #5
zh_cn: 颜色 #5

source: Color RGB:\&nbsp; {0}
zh_cn: 颜色 RGB:\&nbsp; {0}

source: Color Scheme
zh_cn: 切换配色方案

source: Color name:\&nbsp; {0}
zh_cn: 颜色名:\&nbsp; {0}

source: Color printing
zh_cn: 彩印

source: Color scheme
zh_cn: 配色方案

source: Color schemes
zh_cn: 颜色方案

source: Colors \& Fonts
zh_cn: 颜色 \& 字体

source: Column
zh_cn: 列

source: Column Selection _Mode
zh_cn: 列选择模式(_M)

source: Column number
zh_cn: 列号

source: Comm&ents only
zh_cn: 仅注释(&E)

source: Comm&it
zh_cn: 提交(&I)

source: Comm&it Changes
zh_cn: 提交更改(&I)

source: Comm_it
zh_cn: 提交(_I)

source: Comm_it Changes
zh_cn: 提交更改(_I)

source: Comm_it File
zh_cn: 提交文件(_I)

source: Comm_it Project
zh_cn: 提交项目(_I)

source: Commander View Popup Menu
zh_cn: 命令视图弹出菜单

source: Comment
zh_cn: 注释

source: Comment Actions
zh_cn: 注释操作

source: Comment Code
zh_cn: 注释的代码

source: Comment Is Empty
zh_cn: 注释是空的

source: Comment at first column
zh_cn: 注释在第一列

source: Comment out
zh_cn: 注释掉

source: Comment with _Block Comment
zh_cn: 块注释(_B)

source: Comment with _Line Comment
zh_cn: 行注释(_L)

source: Comment/Uncomment block
zh_cn: 注释/取消注释代码块

source: Comment/Uncomment current line
zh_cn: 注释/取消注释当前行

source: Comment/uncomment code with block comments
zh_cn: 用块注释注释/取消代码

source: Comment/uncomment current line or selected block with line comments
zh_cn: 注释/取消注释当前行或选中块

source: Comments
zh_cn: 注释

source: Comments//Block comment
zh_cn: 注释//块注释

source: Comments//Doc Comment//Markup
zh_cn: 注释//文档注释//标记

source: Comments//Doc Comment//Tag
zh_cn: 注释//文档注释//标签

source: Comments//Doc Comment//Tag value
zh_cn: 注释//文档注释//标签值

source: Comments//Doc Comment//Text
zh_cn: 注释//文档注释//文本

source: Comments//JavaDoc//Markup
zh_cn: 注释//JavaDoc//标记

source: Comments//JavaDoc//Tag
zh_cn: 注释//JavaDoc//标签

source: Comments//JavaDoc//Tag value
zh_cn: 注释//JavaDoc//标签值

source: Comments//JavaDoc//Text
zh_cn: 注释//JavaDoc//文本

source: Comments//Line comment
zh_cn: 注释//行注释

source: Comments//Shebang comment
zh_cn: 注释//Shebang 注释
